#+TITLE: Configuration
#+AUTHOR: Kalelzar

#+BEGIN_SRC emacs-lisp :tangle yes :exports none

;;; config.el -- Tangled source code of config.org -*- lexical-binding: t -*-
;;; Commentary:
;;; This is just an executable file created by pasting
;;; all emacs-lisp source code blocks from config.org into
;;; this file.

;;; Code:


#+END_SRC

* Misc

Set the customize file to a separate file.

#+BEGIN_SRC emacs-lisp :tangle yes

(setq custom-file (expand-file-name "custom.el" user-emacs-directory))

(load custom-file)
#+END_SRC



#+begin_src emacs-lisp :tangle yes

(defun get-repo-for-title ()
  (when buffer-file-name
    (s-wrap
   (s-chop-prefix "/"
                  (second
                   (s-split ":"
                            (repo-origin
                             (projectile-project-root
                              (f-dirname
                               (buffer-file-name)))))))
   "[" "]")))

;(setq frame-title-format
;                    '("" "emacs - %b " (:eval (get-repo-for-title))))



#+end_src

Allow installations from packages from github

#+begin_src emacs-lisp :tangle yes
(quelpa
 '(quelpa-use-package
   :fetcher git
   :url "https://github.com/quelpa/quelpa-use-package.git"))
(require 'quelpa-use-package)
#+end_src

#+RESULTS:
: quelpa-use-package



Set up [[https://melpa.org/#/lsp-mode][Language Server Protocol]].

This (or an equivalent, [[https://github.com/joaotavora/eglot][see eglot]]) is a
must for any serious development.

You /could/ theoretically go without it (considering it is a big performance hit)
but it *is* hard for me to justify it.

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package lsp-mode
  :commands lsp
  :hook ((c++-mode scala-mode) . #'lsp))
(use-package lsp-ui
  :commands lsp-ui-mode
  :after lsp)
(use-package company-lsp
  :commands company-lsp
  :after (lsp company))
#+END_SRC

#+RESULTS:

Kill. Whole. Lines. This should be the default.
I really don't understand why it isn't.

Not really necessary if you use ~crux-kill-whole-line~ like you are supposed to.

#+begin_src emacs-lisp :tangle yes
(setq kill-whole-line t)
#+end_src

#+RESULTS:
: t

I don't actually know what this does but the EmacsWiki told me to
put it in.

#+begin_src emacs-lisp :tangle yes
(autoload 'wl "wl" "Wanderlust" t)
#+end_src

#+RESULTS:
: wl

Watch my [[https://melpa.org/#/activity-watch-mode][emacs activity]] with
[[https://github.com/ActivityWatch/activitywatch/][ActivityWatch]]

#+begin_src emacs-lisp :tangle yes
(when (executable-find "aw-server")
  (use-package activity-watch-mode
    :defer 5
    :config (global-activity-watch-mode)
    :diminish activity-watch-mode))
#+end_src

#+RESULTS:

Set [[https://github.com/pwmt/zathura][zathura]] as the default pdf viewer

#+BEGIN_SRC bash
sudo pacman -S zathura zathura-pdf-mupdf
#+END_SRC

#+RESULTS:

#+begin_src emacs-lisp :tangle yes
(with-eval-after-load 'tex
  (require 'tex)
  (add-to-list 'TeX-view-program-selection
               '(output-pdf "Zathura")))
#+end_src

#+RESULTS:

More convenient ~*scratch*~ buffers

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package scratch
  :commands scratch)
#+END_SRC

#+RESULTS:


~undo-tree~ is absolutely necessary.
You really shouldn't do anything without it (or an equivalent).

#+BEGIN_SRC emacs-lisp :tangle yes
(setq use-package-ensure-function 'use-package-ensure-elpa)
(use-package undo-tree
;  :quelpa (undo-tree :fetcher url
;                     :url "http://git.savannah.gnu.org/cgit/emacs/elpa.git/plain/packages/undo-tree/undo-tree.el")
  :diminish undo-tree-mode
  :config (global-undo-tree-mode))
(setq use-package-ensure-function 'quelpa)
#+END_SRC

#+RESULTS:
: t

Crux.

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package crux)
#+END_SRC

#+RESULTS:

Auto rename pair tag in html/xml

#+begin_src emacs-lisp :tangle yes
(use-package auto-rename-tag
  :defer t)
#+end_src


Revert buffer automatically when underlying file is changed outside of Emacs.

#+BEGIN_SRC emacs-lisp :tangle yes
(global-auto-revert-mode t)
#+END_SRC

#+RESULTS:
: t

Smarter tab.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq tab-always-indent 'complete)
#+END_SRC

#+RESULTS:
: complete

Switch between visible buffers / frames with shift + arrow keys

This requires =framemove.el= from [[https://github.com/emacsmirror/emacswiki.org/blob/master/framemove.el][EmacsWiki]].

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package windmove
  :bind (("S-<up>" . windmove-up)
         ("S-<left>" . windmove-left)
         ("S-<right>" . windmove-right)
         ("S-<down>" . windmove-down)))
;(add-to-list 'load-path "~/.config/emacs/elpa/framemove/")
;(require 'framemove)
(use-package framemove
   :quelpa (framemove
            :fetcher url
            :url "https://raw.githubusercontent.com/emacsmirror/emacswiki.org/master/framemove.el")
   :after windmove
   :config
   (setq framemove-hook-into-windmove t)
   (windmove-default-keybindings))
#+END_SRC

#+RESULTS:
: t



Save buffers on buffer switch

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package super-save
  :diminish super-save-mode
  :config (super-save-mode +1))
;; add integration with ace-window
(add-to-list 'super-save-triggers 'ace-window)
#+END_SRC

#+RESULTS:
| ace-window | switch-to-buffer | other-window | windmove-up | windmove-down | windmove-left | windmove-right | next-buffer | previous-buffer |

Highlighting
#+BEGIN_SRC emacs-lisp :tangle yes
(global-hl-line-mode +1)
(diminish 'hl-line-mode)
#+END_SRC

#+RESULTS:

Add the ability to kill the current line without marking it

#+BEGIN_SRC emacs-lisp :tangle yes
;(use-package rect )
(require 'rect)
(crux-with-region-or-line kill-region)
(crux-with-region-or-line kill-ring-save)
#+END_SRC

#+RESULTS:
: kill-ring-save

Automatically clean up unused buffers.
#+BEGIN_SRC emacs-lisp :tangle yes
(use-package midnight
  :defer 30)
#+END_SRC

#+RESULTS:

Do not activate mark if there is no active region when
~exchange-point-and-mark~ (C-x C-x by default) is called.

#+BEGIN_SRC emacs-lisp :tangle yes
(defadvice exchange-point-and-mark (before deactivate-mark activate compile)
  "When called with no active region, do not activate mark."
  (interactive "P")
   (list (not (region-active-p))))
#+END_SRC

#+RESULTS:
: exchange-point-and-mark

Create macro for calling functions on region or buffer

#+BEGIN_SRC emacs-lisp :tangle yes
(defmacro with-region-or-buffer (func)
  "When called with no active region, call FUNC on current buffer."
  `(defadvice ,func (before with-region-or-buffer activate compile)
     (interactive
      (if mark-active
          (list (region-beginning) (region-end))
        (list (point-min) (point-max))))))

(with-region-or-buffer indent-region)
#+END_SRC

#+RESULTS:
: indent-region

Show available keybindings after you start typing

#+BEGIN_SRC emacs-lisp :tangle yes

;; show available keybindings after you start typing
(use-package which-key
  :config
  (which-key-mode +1)
  (which-key-enable-god-mode-support nil)
  :diminish which-key-mode)
#+END_SRC

#+RESULTS:
: t

Following config mostly taken from [[https://github.com/bbatsov][bbatsov's]] [[https://github.com/bbatsov/prelude][Prelude]].

#+begin_src emacs-lisp :tangle yes

;; Copyright © 2011-2020 Bozhidar Batsov
;;
;; Author: Bozhidar Batsov <bozhidar@batsov.com>
;; URL: https://github.com/bbatsov/prelude
;; Version: 1.0.0
;; Keywords: convenience

(use-package smartparens
  :config ;; smart curly braces
  (sp-pair "{" nil :post-handlers
  '(((lambda (&rest _ignored)
  (crux-smart-open-line-above)) "RET"))))

(defun prelude-local-comment-auto-fill ()
  (set (make-local-variable 'comment-auto-fill-only-comments) t))

;; show the name of the current function definition in the modeline
(use-package which-func
  :config (which-function-mode 1))

;; font-lock annotations like TODO in source code
(use-package hl-todo
  :config (global-hl-todo-mode 1))

;; in Emacs 24 programming major modes generally derive from a common
;; mode named prog-mode; for others, we'll arrange for our mode
;; defaults function to run prelude-prog-mode-hook directly.  To
;; augment and/or counteract these defaults your own function
;; to prelude-prog-mode-hook, using:
;;
;;     (add-hook 'prelude-prog-mode-hook 'my-prog-mode-defaults t)
;;
;; (the final optional t sets the *append* argument)

(defun prelude-prog-mode-defaults ()
  "Default coding hook, useful with any programming language."
  (flyspell-prog-mode)
  (smartparens-mode +1)
  (prelude-local-comment-auto-fill))

(setq prelude-prog-mode-hook 'prelude-prog-mode-defaults)

(add-hook 'prog-mode-hook (lambda ()
                            (run-hooks 'prelude-prog-mode-hook)))

;; enable on-the-fly syntax checking
#+end_src

#+RESULTS:
| lambda | nil | (run-hooks 'prelude-prog-mode-hook) |
* Sane Defaults

Some are sourced from [[https://github.com/danielmai/.emacs.d/blob/master/config.org][Daniel Mai's config]].

For some reason these functions are disabled.

#+BEGIN_SRC emacs-lisp :tangle yes
(put 'downcase-region 'disabled nil)
(put 'upcase-region 'disabled nil)
(put 'narrow-to-region 'disabled nil)
(put 'dired-find-alternate-file 'disabled nil)
#+END_SRC

#+RESULTS:

Yes is two letters too long for me.

#+BEGIN_SRC emacs-lisp :tangle yes
(defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC

#+RESULTS:
: yes-or-no-p

Clean up back-ups / autosaves.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq backup-directory-alist `(("." . ,(concat user-emacs-directory "backups"))))
(setq auto-save-file-name-transforms `((".*" ,(concat user-emacs-directory "auto-save-list/") t)))
#+END_SRC

#+RESULTS:
| .* | /home/kalelzar/.config/emacs/auto-save-list/ | t |

UTF-8.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
#+END_SRC

#+RESULTS:

Don't indent with TABS please.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq-default indent-tabs-mode nil)
#+END_SRC

#+RESULTS:

Indicate empty lines.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq-default indicate-empty-lines t)
#+END_SRC

#+RESULTS:
: t

Don't count two spaces after a period as the end of a sentence.
Just one space is needed.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq sentence-end-double-space nil)
#+END_SRC

#+RESULTS:

Delete the region when typing.

#+BEGIN_SRC emacs-lisp :tangle yes
(delete-selection-mode t)
#+END_SRC

#+RESULTS:
: t

Logical buffer names.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq uniquify-buffer-name-style 'forward)
#+END_SRC

#+RESULTS:
: forward

Load aliases from .bash_profile

#+BEGIN_SRC emacs-lisp :tangle yes
(setq shell-command-switch "-ic")
#+END_SRC

#+RESULTS:
: -ic

Silence!

#+BEGIN_SRC emacs-lisp :tangle yes
(setq visible-bell t)
(setq ring-bell-function 'ignore)
#+END_SRC

#+RESULTS:
: ignore

*** Export

I mainly export to \LaTeX but that comes installed by default.

#+RESULTS:

#+begin_src emacs-lisp :tangle yes
  (setq org-export-backends
     (quote
      (html latex)))
#+end_src

#+RESULTS:
| ascii | beamer | html | latex | epub |

Enable linting of source code blocks when exported to \LaTeX
This requires [[https://github.com/gpoore/minted][minted]].

On Archlinux:

#+BEGIN_SRC bash
sudo pacman -S minted
#+END_SRC

#+RESULTS:

You also might need to install some of the (La)TeX libraries included by your distribution.

#+begin_src emacs-lisp :tangle yes
  (use-package ox-latex
    :after org
    :config
    (add-to-list 'org-latex-packages-alist '("" "minted"))
    (add-to-list 'org-latex-packages-alist '("" "color"))
    (add-to-list 'org-latex-packages-alist '("" "xcolor"))
    (add-to-list 'org-latex-packages-alist '("" "mathtools"))
    (add-to-list 'org-latex-packages-alist '("" "amsmath"))
    (setq org-latex-listings 'minted)

    (setq org-latex-pdf-process
          '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f")))
#+end_src

#+RESULTS:
: t

*** Templates

Enable Org Tempo mode for template expansion

#+begin_src emacs-lisp :tangle yes
  (use-package org-tempo)
#+end_src

#+RESULTS:

Source blocks
#+BEGIN_SRC emacs-lisp :tangle yes
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("ll" . "src lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("sh" . "src sh"))
(add-to-list 'org-structure-template-alist '("bh" . "src bash"))
(add-to-list 'org-structure-template-alist '("sc" . "src scala"))
#+END_SRC

#+RESULTS:
: ((sc . src scala) (bh . src bash) (sh . src sh) (py . src python) (ll . src lisp) (el . src emacs-lisp) (a . export ascii) (c . center) (C . comment) (e . example) (E . export) (h . export html) (l . export latex) (q . quote) (s . src) (v . verse))

*** Misc
Set up emphasis symbols

#+begin_src emacs-lisp :tangle yes
  (setq org-emphasis-alist
        (quote
         (("*" bold)
          ("/" italic)
          ("_" underline)
          ("=" org-verbatim verbatim)
          ("~" org-code verbatim)
          ("+"
           (:strike-through t)))))
#+end_src

#+RESULTS:
| * | bold                |          |
| _ | underline           |          |
| = | org-verbatim        | verbatim |
| ~ | org-code            | verbatim |
| + | (:strike-through t) |          |

Set up better link previews using [[https://github.com/stardiviner/org-link-beautify][org-link-beautify]].

It is not available in MELPA.

So we have to install it manually.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package org-link-beautify
  :quelpa (org-link-beautify
           :fetcher github
           :repo "stardiviner/org-link-beautify")
  :disabled t)
#+END_SRC

#+RESULTS:

Or so I would like. But it's way too laggy and the icons show up wrong for me.

Enable some good minor modes for working with org-mode
when /in/ org-mode.

#+begin_src emacs-lisp :tangle yes
    (use-package org-superstar)
    ;(use-package org-sticky-header )
    (setq use-package-ensure-function 'use-package-ensure-elpa)
    (use-package tex-site :ensure auctex)
    (setq use-package-ensure-function 'quelpa)
    (use-package cdlatex
      :after tex-site)

    (defun org-mode-enable-minor-modes-hook ()
      "Enable some good minor-modes for fancier 'org-mode' experience."
      (org-superstar-mode 1)
      (diminish 'org-superstar-mode)
      ;;(org-sticky-header-mode 1)
      (org-indent-mode 1)
      (diminish 'org-indent-mode)
      ;;(org-cdlatex-mode 1)
      (diminish 'org-cdlatex-mode)
      (yas-minor-mode 1)
      (diminish 'yas-minor-mode)
      (fira-code-mode 1)
      (diminish 'fira-code-mode)
      ;;(org-link-beautify-mode 1)
      )

(add-hook 'org-mode-hook 'org-mode-enable-minor-modes-hook)
#+end_src

#+RESULTS:
| org-mode-enable-minor-modes-hook | org-tempo-setup | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

Let TAB behave as expected when inside code block.

#+begin_src emacs-lisp :tangle yes
(setq org-src-tab-acts-natively t)
#+end_src

#+RESULTS:
: t

Set the default notes file.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq org-default-notes-file "~/Documents/notes.org")
#+END_SRC

#+RESULTS:
: ~/Documents/notes.org

Enable speed commands.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq org-use-speed-commands t)
#+END_SRC

#+RESULTS:
: t

#+BEGIN_SRC emacs-lisp :tangle yes
(setq org-tags-column 45)
#+END_SRC

#+RESULTS:
: 45

Enable windmove/framemove in org-mode.

#+begin_src emacs-lisp :tangle yes
;(setq org-support-shift-select nil)
(add-hook 'org-shiftup-final-hook 'windmove-up)
(add-hook 'org-shiftleft-final-hook 'windmove-left)
(add-hook 'org-shiftdown-final-hook 'windmove-down)
(add-hook 'org-shiftright-final-hook 'windmove-right)
#+end_src

#+RESULTS:
| windmove-right |

Make latex previews in org-mode twice as big.

#+begin_src emacs-lisp :tangle yes
(setq org-format-latex-options (append '(:scale 2.0) org-format-latex-options ))
#+end_src

#+RESULTS:
| :scale | 2.0 | :foreground | default | :background | default | :scale | 2.0 | :html-foreground | Black | :html-background | Transparent | :html-scale | 1.0 | :matchers | (begin $1 $ $$ \( \[) |

Add custom TODO keywords

#+begin_src emacs-lisp :tangle yes

(setq org-todo-keywords
  '((sequence "INACTIVE(i!)" "SCHEDULED(s!)" "NEXT(n!)" "ACTIVE(a!)" "|" "DONE(d!)" "CANCELLED(c!)")
    (sequence "SUSPENDED(p!)")
    (sequence "EXPORT(e)" "|" "EXPORTED")))
#+end_src

#+RESULTS:
| sequence | INACTIVE(i!)  | SCHEDULED(s!) | NEXT(n!) | ACTIVE(a!) |   |   | DONE(d!) | CANCELLED(c!) |
| sequence | SUSPENDED(p!) |               |          |            |   |   |          |               |
| sequence | EXPORT(e)     |               |          | EXPORTED   |   |   |          |               |

Set custom faces for TODO keywords.

#+begin_src emacs-lisp :tangle yes
(setq org-todo-keyword-faces
  '(("INACTIVE" . "#004488" )
    ("SCHEDULED" . "#aa6600")
    ("NEXT" . "#006622")
    ("ACTIVE" . (:background "#004400" :foreground "white" :weight bold ))
    ("SUSPENDED" . (:background "#440000" :foreground "white" :weight bold ))
    ("DONE" . (:foreground "#204420" :weight bold))
    ("CANCELLED" . "#616161" )
    ("EXPORT" . (:background "#443322" :foreground "#ffaa00" ))
    ("EXPORTED" . "#414141" )))
#+end_src

#+RESULTS:
: ((INACTIVE . #004488) (SCHEDULED . #aa6600) (NEXT . #006622) (ACTIVE :background #004400 :foreground white :weight bold) (SUSPENDED :background #440000 :foreground white :weight bold) (DONE :foreground #204420 :weight bold) (CANCELLED . #616161) (EXPORT :background #443322 :foreground #ffaa00) (EXPORTED . #414141))

Obviously you can't really work on two tasks at the same time.
So let's enforce a single ACTIVE task at all times.

#+begin_src emacs-lisp :tangle yes
(when (file-exists-p "~/Code/Projects/kaltask")
  (use-package kaltask
    :quelpa (kaltask :fetcher file
                     :path "~/Code/Projects/kaltask")))
#+end_src

#+RESULTS:


Enforce todo dependencies.

#+begin_src emacs-lisp :tangle yes
(setq org-enforce-todo-dependencies t)
#+end_src

#+RESULTS:
: t

Enable org-drill.

#+begin_src emacs-lisp :tangle yes
(use-package org-drill)
(setq org-drill-hide-item-headings-p t)
#+end_src

Show live-preview of latex fragements.

#+begin_src emacs-lisp :tangle yes
(use-package org-elp)
#+end_src

Add a company backend for math.

#+begin_src emacs-lisp :tangle yes
(use-package company-math
  :after company)
#+end_src

*** Agenda

Register the agenda files.

#+begin_src emacs-lisp :tangle yes
(defvar org-agenda-files-root
  "~/Documents/" "Store the root of all org-agenda files")

;(setq org-agenda-files nil)

(defvar org-agenda-files-assoc
  '(( "agenda" . ( "* INACTIVE %?\nAdded on %U\n%i" org-ask-location))
    ( "notes" . "* INACTIVE %?\nAdded on %U\n%i")
    ( "tickler" . "* INACTIVE %?\nDEADLINE: %^{Deadline}T\nAdded on %U\n%a\n%i"))
"A agenda name associated with the format for org-capture entries."
)

(defun expand-to-agenda-file (file)
  "Expand FILE to a path to an .org file located at `org-agenda-files-root'."
  (concat (concat org-agenda-files-root file) ".org"))


(defun org-register-agenda-file (file)
  "Register an agenda FILE."
  (add-to-list 'org-agenda-files
               (expand-to-agenda-file file)))


(seq-do 'org-register-agenda-file
              (mapcar (lambda (elem)  (car elem))
                      org-agenda-files-assoc))

(defvar org-agenda-shortcuts-prefix-key "H-z"
  "Prefix key for accessing org-agenda-shortcuts")

(bind-key
 (concat org-agenda-shortcuts-prefix-key
         (concat " " org-agenda-shortcuts-prefix-key))
 'previous-buffer)

(defun generate-shortcuts-to-agenda-file (agenda-file)
  (let* ((key (char-to-string (string-to-char agenda-file)))
         (key-chords (concat org-agenda-shortcuts-prefix-key (concat " " key))))
    (bind-key key-chords `(lambda () (interactive) (find-file (expand-to-agenda-file ,agenda-file))))
    (which-key-add-key-based-replacements key-chords agenda-file)
))

(seq-do 'generate-shortcuts-to-agenda-file
              (mapcar (lambda (elem)  (car elem))
                      org-agenda-files-assoc))

#+end_src

#+RESULTS:
| agenda | notes | tickler |

Create capture templates for quick writes to different
agenda files.

#+begin_src emacs-lisp :tangle yes
(defun org-ask-location ()
  (setq org-refile-use-outline-path nil)
  (let* ((org-refile-targets '((nil :maxlevel . 1)))
         (hd (condition-case nil
                 (car (org-refile-get-location "Headline" nil t))
               (error (car org-refile-history)))))
    (goto-char (point-min))
    (outline-next-heading)
    (if (re-search-forward
         (format org-complex-heading-regexp-format (regexp-quote hd))
         nil t)
        (goto-char (point-at-bol))
      (goto-char (point-max))
      (or (bolp) (insert "\n"))
      (insert "* " hd "\n")))
  (setq org-refile-use-outline-path 'file)
  (end-of-line))

(setq org-capture-templates nil)

(defun build-capture-template-definition
    (capture-key capture-description agenda-file template)
  "Generate a capture template.
 The capture template can be accessed with CAPTURE-KEY.
 It is described by CAPTURE-DESCRIPTION.
 It points to AGENDA-FILE.
 And it uses TEMPLATE to generate the entry.
 TEMPLATE is either a string with which to format the entry,
 or a cons cell of a string with which to format the entry and a function which
 tells where exactly in the file to add the new entry."
  (append (list capture-key capture-description)
          '(entry)
          (if (char-or-string-p template)
          (list (append '(file)
                        (list agenda-file)))
          (list (append '(file+function)
                        (list agenda-file) (cdr template))))
          (if (char-or-string-p template)
              (list template)
              (list (car template)))))

(defun org-generate-agenda-capture-template-definition (agenda-file)
  (let* ((agenda-name (file-name-base agenda-file))
         (capture-key (char-to-string (string-to-char agenda-name)))
         (capture-description (concat (concat "Add entry to " agenda-name) "."))
         (template (cdr (assoc agenda-name org-agenda-files-assoc))))
    (build-capture-template-definition
     capture-key capture-description agenda-file template)))

(defun register-agenda-capture-template-from-agenda-file (agenda-file)
  (add-to-list 'org-capture-templates
      (org-generate-agenda-capture-template-definition agenda-file)))

(defun register-agenda-capture-templates-from-agenda-files ()
  (seq-do 'register-agenda-capture-template-from-agenda-file
        org-agenda-files))

(register-agenda-capture-templates-from-agenda-files)

(add-to-list 'org-capture-templates
  (build-capture-template-definition "e" "Export entry"
    (expand-to-agenda-file "notes")
    "* EXPORT %?\nAdded on %U\n%i" ))

#+end_src

#+RESULTS:
| e | Export entry | entry | (file ~/Documents/notes.org) | * EXPORT %? |

Add state changes to a drawer.

#+begin_src emacs-lisp :tangle yes
(setq org-log-into-drawer t)
#+end_src

#+RESULTS:
: t

Set up archivation.

#+begin_src emacs-lisp :tangle yes
(setq org-archive-location (concat (expand-to-agenda-file "archive") "::"))

;;Requires Org >= 9.4
;(setq org-archive-subtree-save-file-p t)
;;Org < 9.4

(defun save-notes-archive-file ()
  (interactive)
  (save-some-buffers
   'no-confirm (lambda ()
                 (equal buffer-file-name
                        (expand-file-name (expand-to-agenda-file "archive"))))))

(advice-add 'org-archive-subtree :after #'save-notes-archive-file)

#+end_src

#+RESULTS:

Set up refiling

#+begin_src emacs-lisp :tangle yes
  (setq org-refile-use-outline-path 'file)
  (setq org-refile-targets '((org-agenda-files . (:level . 0))))

  (defvar org-files-refile-internally
  (list (expand-file-name (expand-to-agenda-file "agenda")))
  "List of files which should be offered a list of internal headlines
  instead of other files")

  (defun dynamic-org-refile-get-targets (func &rest args)
    "Extend `org-refile-get-targets' in various contexts.
     If the file visited in current buffer is inside
     `org-files-refile-internally' then show a list of top-level headings to
     refile to instead of the default `org-refile-targets'.
     If the file visited in current buffer is a member of
     `org-agenda-files', remove it from the list so it doesn't clutter the
     target list. All changes to variables are restored at the end of the
     function."
     (setq org-refile-history nil)
     (let ((current-file (buffer-file-name (current-buffer))))
       (if (member current-file org-files-refile-internally)
           (let ((org-refile-use-outline-path nil)
                 (org-refile-targets nil))
             (apply func args))
         (let ((org-agenda-files (remove-if
             (lambda (file)
               (equal current-file (expand-file-name file)))
             org-agenda-files)))
           (apply func args)))))

  (advice-add 'org-refile-get-targets :around #'dynamic-org-refile-get-targets)
#+end_src

#+RESULTS:

Set up alerts for agenda items.

#+begin_src emacs-lisp :tangle yes
(use-package org-wild-notifier
  :after org
  :config
  (setq alert-default-style 'libnotify)
  (setq org-wild-notifier-keyword-whitelist nil)
  (org-wild-notifier-mode 1))
#+end_src

#+RESULTS:
: t

** C/C++

Set LSP for C/C++ using [[https://github.com/MaskRay/ccls][ccls]].

#+BEGIN_SRC bash
sudo pacman -S ccls
#+END_SRC

We also need the [[https://melpa.org/#/ccls][emacs package]].

#+begin_src emacs-lisp :tangle yes
(use-package ccls
  :hook ((c-mode c++-mode objc-mode cuda-mode) .
         (lambda ()
           (ccls-code-lens-mode))))

(setq ccls-executable "/usr/bin/ccls")
#+end_src

#+RESULTS:
: /usr/bin/ccls

Enable some refactoring with [[https://melpa.org/#/srefactor][srefactor]].

#+begin_src emacs-lisp :tangle yes
  (use-package srefactor
    :after ccls)
#+end_src

#+RESULTS:

This package displays function signatures in the mode line.
#+begin_src emacs-lisp :tangle yes
 (use-package c-eldoc
  :commands c-turn-on-eldoc-mode
  :init (add-hook 'c-mode-hook 'c-turn-on-eldoc-mode))
#+end_src

#+RESULTS:
| c-turn-on-eldoc-mode | (lambda nil (ccls-code-lens-mode)) | macrostep-c-mode-hook |

** Whitespace
#+BEGIN_SRC emacs-lisp :tangle yes
(use-package whitespace)

(setq whitespace-line-column 80) ;; limit line length
(setq whitespace-style '(face tabs empty trailing lines-tail))
(global-whitespace-mode)
(diminish 'global-whitespace-mode)

(defun cleanup-on-save ()
  "Call `whitespace-cleanup' on save"
  (whitespace-cleanup))

(add-hook 'before-save-hook 'cleanup-on-save)
#+END_SRC

#+RESULTS:
| cleanup-on-save |

** Magit
A great interface for git projects.
It’s much more pleasant to use than the git interface
on the command line. Use an easy keybinding to access magit.

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package magit
  :demand
  :bind (("C-c g" . magit-status)
         ("C-c G" . magit-dispatch)
         ("C-c m l" . magit-log-buffer-file)
         ("C-c m b" . magit-blame)
         ("C-c m m" . magit-list-repositories))
  :config
  (setq magit-display-buffer-function 'magit-display-buffer-same-window-except-diff-v1)
  (setq magit-diff-refine-hunk t)
  (add-hook 'magit-process-find-password-functions
            #'magit-process-password-auth-source)
  (setq magit-repository-directories '(("~/" . 0)
                                       ("~/.config/" . 3)
                                       ("~/Code" . 2)
                                       ("~/.local/src" . 4)
                                       ("~/Documents/Knowledge" . 1))))
#+END_SRC

#+RESULTS:
| magit-process-password-auth-source |

#+BEGIN_QUOTE
    The following code makes magit-status run alone in the frame, and then restores the old window configuration when you quit out of magit.

    No more juggling windows after commiting. It’s magit bliss.
#+END_QUOTE

From: [[http://whattheemacsd.com/setup-magit.el-01.html][Magnar Sveen]]

#+BEGIN_SRC emacs-lisp :tangle yes
;; full screen magit-status
(defadvice magit-status (around magit-fullscreen activate)
  "Make Magit full screen and restore windows when done."
  (window-configuration-to-register :magit-fullscreen)
  ad-do-it
  (delete-other-windows))

(defun magit-quit-session ()
  "Restore the previous window configuration and kill the magit buffer."
  (interactive)
  (kill-buffer)
  (jump-to-register :magit-fullscreen))
#+END_SRC

#+RESULTS:
: magit-quit-session

Magit extension for GitHub/GitLab

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package forge
  :after magit)
#+END_SRC

#+RESULTS:

*** Prelude
Following lisp config mostly taken from [[https://github.com/bbatsov][bbatsov's]] [[https://github.com/bbatsov/prelude][Prelude]].

#+begin_src emacs-lisp :tangle yes
(use-package rainbow-delimiters)

(define-key read-expression-map (kbd "TAB") 'completion-at-point)

(defun prelude-lisp-coding-defaults ()
  (smartparens-strict-mode +1)
  (rainbow-delimiters-mode +1))

(setq prelude-lisp-coding-hook 'prelude-lisp-coding-defaults)

;; interactive modes don't need whitespace checks
(defun prelude-interactive-lisp-coding-defaults ()
  (smartparens-strict-mode +1)
  (rainbow-delimiters-mode +1)
  (whitespace-mode -1))

(setq prelude-interactive-lisp-coding-hook
      'prelude-interactive-lisp-coding-defaults)

(add-hook 'lisp-mode-hook (lambda ()
                                  (run-hooks 'prelude-lisp-coding-hook)))
#+end_src

#+RESULTS:
| (lambda nil (run-hooks 'prelude-lisp-coding-hook)) | slime-lisp-mode-hook |

*** Prelude
Following emacs-lisp config mostly taken from [[https://github.com/bbatsov][bbatsov's]] [[https://github.com/bbatsov/prelude][Prelude]].

#+begin_src emacs-lisp :tangle yes

  (setq use-package-ensure-function 'use-package-ensure-elpa)
  (use-package rainbow-mode)
  (setq use-package-ensure-function 'quelpa)
  (use-package crux)
  ;(use-package elisp-slime-nav )

  (defun prelude-recompile-elc-on-save ()
    "Recompile your elc when saving an elisp file."
    (add-hook 'after-save-hook
              (lambda ()
                (when
                       (file-exists-p (byte-compile-dest-file buffer-file-name))
                  (emacs-lisp-byte-compile)))
              nil
              t))

  (define-key emacs-lisp-mode-map (kbd "C-c C-c") 'eval-defun)
  (define-key emacs-lisp-mode-map (kbd "C-c C-b") 'eval-buffer)

  (defun prelude-conditional-emacs-lisp-checker ()
    "Don't check doc style in Emacs Lisp test files."
    (let ((file-name (buffer-file-name)))
      (when (and file-name (string-match-p ".*-tests?\\.el\\'" file-name))
        (setq-local flycheck-checkers '(emacs-lisp)))))


  (defun prelude-emacs-lisp-mode-defaults ()
    "Sensible defaults for `emacs-lisp-mode'."
    (run-hooks 'prelude-lisp-coding-hook)
    (eldoc-mode +1)
    (prelude-recompile-elc-on-save)
    (rainbow-mode +1)
    (setq mode-name "EL")
    (prelude-conditional-emacs-lisp-checker))

  (setq prelude-emacs-lisp-mode-hook 'prelude-emacs-lisp-mode-defaults)

  (add-hook 'emacs-lisp-mode-hook (lambda ()
                                    (run-hooks 'prelude-emacs-lisp-mode-hook)))

  ;(with-eval-after-load "elisp-slime-nav"
   ; (diminish 'elisp-slime-nav-mode))
  (with-eval-after-load "rainbow-mode"
    (diminish 'rainbow-mode))
  (with-eval-after-load "eldoc"
    (diminish 'eldoc-mode))

  ;(add-hook 'emacs-lisp-mode-hook (lambda () (elisp-slime-nav-move 1)))

  (defun conditionally-enable-smartparens-mode ()
    "Enable `smartparens-mode' in the minibuffer, during `eval-expression'."
    (if (eq this-command 'eval-expression)
        (smartparens-mode 1)))

  (add-hook 'minibuffer-setup-hook 'conditionally-enable-smartparens-mode)

#+end_src

#+RESULTS:
| conditionally-enable-smartparens-mode | rfn-eshadow-setup-minibuffer | minibuffer-error-initialize | minibuffer-history-isearch-setup | minibuffer-history-initialize |

** Splash
Lately I've felt like opening =*scratch*= when I start Emacs
is sort of a waste.

I use =*scratch*= sparingly so having some kind of hub thingy instead
could be more useful.


So I want to implement one.

I don't have any idea what might be useful there so let's just wing it.


Having some recently visited files might be nice.

So firstly let's write a function to get the last N visited files.
I use =recentf= to keep track of that usually so we can probably get the
information from there.

#+begin_src emacs-lisp :tangle yes
(defun last-visited (&optional count)
  "Find last COUNT visited items."
  (cl-loop for n
         from 0
         below (or count 10)
         collect (nth n recentf-list)))
#+end_src

There has to be an emacs lisp function to get the first N elements of a list
that I can't find. This will do until I figure it out.


Maybe being able to see my last active repos could be fine.

I don't think =magit= stores your last active repos so we can just approximate
with the function above

#+begin_src emacs-lisp :tangle yes

(defun last-repos-dir (&optional count)
  "Find last active repositories, checking the last COUNT files visited."
  (remove-duplicates
   (flatten-list
    (remove-if #'null
               (mapcar #'magit-toplevel
                       (last-visited (or count 30)))))
   :test #'string=))

#+end_src

This however returns the /local (or remote really)/ path where the repo is
cloned.



#+begin_src emacs-lisp :tangle yes

(defmacro magit-with-repository (repo &rest body)
  "Evaluate BODY as if REPO was the currently active directory."
  `(let ((default-directory ,repo))
     ,@body
     ))

(defun repo-origin (repo)
  "Return the origin remote of REPO."
  (magit-with-repository repo
                         (magit-get "remote.origin.url")))

(defun last-repos (&optional count)
  (mapcar #'repo-origin (last-repos-dir count)))
#+end_src

Let's see if it gets it right.

#+begin_src emacs-lisp :tangle no :results none
(mapcar #'(lambda (repo) (concat repo "\n"))
        (last-repos 1))
#+end_src

#+RESULTS:
| https://github.com/Kalelzar/emacs.git |

\*looks up to address bar\*

Seems right to me.


What else... What else...

Latest commits?

Sure let's go with that.

#+begin_src emacs-lisp :tangle no
(defun latest-commits ()

)
#+end_src

